from extensions import db
from models.table_characters import Character_stats

def seed_characters():
    characters = [
        ('1', 'Солдат 0 Энби', 'Вооружённые силы, Серебрянный отряд', 'S', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', 'Нет', '0', '0', 'Agent_Soldier_0_-_Anby.webp'),
        ('2', 'Джейн Доу', 'Группа особого реагирования угрозыска', 'S', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', 'Нет', '0', '0', 'Agent_Jane_Doe.webp'),
        ('3', 'Хосими Мияби', 'Секция 6', 'S', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', 'Нет', '0', '0', 'Agent_Hoshimi_Miyabi.webp'),
        ('4', 'Цукисиро Янаги', 'Секция 6', 'S', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', 'Нет', '0', '0', 'Agent_Tsukishiro_Yanagi.webp'),
        ('5', 'Бёрнис Вайт', 'Сыны Калидона', 'S', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', 'Нет', '0', '0', 'Agent_Burnice_White.webp'),
        ('6', 'Пайпер Вилл', 'Сыны Калидона', 'A', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', 'Нет', '0', '0', 'Agent_Piper_Wheel.webp'),
        ('7', 'Коляда Белобог', '"Белобог"', 'S', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', 'Нет', '0', '0', 'Agent_Koleda_Belobog.webp'),
        ('8', 'Александрина Себастьян', '"Виктория"', 'S', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', 'Нет', '0', '0', 'Agent_Alexandrina_Sebastian.webp'),
        ('9', 'Цзюй Фуфу', 'Школа горы Юнькуй', 'S', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', 'Нет', '0', '0', 'Agent_Ju_Fufu.webp'),
        ('10', 'Исюань', 'Школа горы Юнькуй', 'S', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', 'Нет', '0', '0', 'Agent_Yixuan.webp'),
        ('11', 'Пань Иньху', 'Школа горы Юнькуй', 'A', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', 'Нет', '0', '0', 'Agent_Pan_Yinhu.webp'),
        ('12', 'Хуго Влад', '"Пересмешники"', 'S', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', 'Нет', '0', '0', 'Agent_Hugo_Vlad.webp'),
        ('13', 'Вивиан Банши', '"Пересмешники"', 'S', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', 'Нет', '0', '0', 'Agent_Vivian_Banshee.webp'),
        ('14', 'Эвелин Шевалье', '"Созвездие Лиры"', 'S', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', 'Нет', '0', '0', 'Agent_Evelyn_Chevalier.webp'),
        ('15', 'Сет Лоуэлл', 'Группа особого реагирования угрозыска', 'A', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', 'Нет', '0', '0', 'Agent_Seth_Lowell.webp'),
        ('16', 'Асаба Харумаса', 'Секция 6', 'A', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', 'Нет', '0', '0', 'Agent_Asaba_Harumasa.webp'),
        ('17', 'Сокаку', 'Секция 6', 'A', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', 'Нет', '0', '0', 'Agent_Soukaku.webp'),
        ('18', 'Солдат 11', 'Вооружённые силы, отряд Обол', 'S', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', 'Нет', '0', '0', 'Agent_Soldier_11.webp'),
        ('19', 'Пульхра Феллини', 'Сыны Калидона', 'A', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', 'Нет', '0', '0', 'Agent_Pulchra_Fellini.webp'),
        ('20', 'Люсиана де Монтефио', 'Сыны Калидона', 'A', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', 'Нет', '0', '0', 'Agent_Luciana_de_Montefio.webp'),
        ('21', 'Грейс Ховард', '"Белобог"', 'S', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', 'Нет', '0', '0', 'Agent_Grace_Howard.webp'),
        ('22', 'Антон Иванов', '"Белобог"', 'A', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', 'Нет', '0', '0', 'Agent_Anton_Ivanov.webp'),
        ('23', 'Бен Биггер', '"Белобог"', 'A', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', 'Нет', '0', '0', 'Agent_Ben_Bigger.webp'),
        ('24', 'Фон Ликаон', '"Виктория"', 'S', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', 'Нет', '0', '0', 'Agent_Von_Lycaon.webp'),
        ('25', 'Корин Уикс', '"Виктория"', 'A', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', 'Нет', '0', '0', 'Agent_Corin_Wickes.webp'),
        ('26', 'Нэкомия Мана', '"Хитрые зайцы"', 'S', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', 'Нет', '0', '0', 'Agent_Nekomiya_Mana.webp'),
        ('27', 'Николь Демара', '"Хитрые зайцы"', 'A', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', 'Нет', '0', '0', 'Agent_Nicole_Demara.webp'),
        ('28', 'Билли Кид', '"Хитрые зайцы"', 'A', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', 'Нет', '0', '0', 'Agent_Billy_Kid.webp'),
        ('29', 'Энби Демара', '"Хитрые зайцы"', 'A', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', 'Нет', '0', '0', 'Agent_Anby_Demara.webp'),
        ('30', 'Диалинь', 'Надзорная служба "Крампус"', 'S', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', 'Нет', '0', '0', 'Agent_Dialyn.webp'),
        ('31', 'Элис Таймфилд', 'Хижина кошмаров', 'S', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', 'Нет', '0', '0', 'Agent_Alice_Thymefield.webp'),
        ('32', 'Астра Яо', '"Созвездие Лиры"', 'S', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', 'Нет', '0', '0', 'Agent_Astra_Yao.webp'),
        ('33', 'Цезарь Кинг', 'Сыны Калидона', 'S', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', 'Нет', '0', '0', 'Agent_Caesar_King.webp'),
        ('34', 'Эллен Джо', '"Виктория"', 'S', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', 'Нет', '0', '0', 'Agent_Ellen_Joe.webp'),
        ('35', 'Комано Манато', 'Хижина кошмаров', 'A', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', 'Нет', '0', '0', 'Agent_Komano_Manato.webp'),
        ('36', 'Лайтер', 'Сыны Калидона', 'S', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', 'Нет', '0', '0', 'Agent_Lighter.webp'),
        ('37', 'Люсия Элоувен', 'Хижина кошмаров', 'S', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', 'Нет', '0', '0', 'Agent_Lucia_Elowen.webp'),
        ('38', 'Орфея и Магус', 'Вооружённые силы, отряд Обол', 'S', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', 'Нет', '0', '0', 'Agent_Orphie_Magnusson_&_Magus.webp'),
        ('39', 'Циньи', 'Группа особого реагирования угрозыска', 'S', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', 'Нет', '0', '0', 'Agent_Qingyi.webp'),
        ('40', 'Сид', 'Вооружённые силы, отряд Обол', 'S', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', 'Нет', '0', '0', 'Agent_Seed.webp'),
        ('41', 'Гашетка', 'Вооружённые силы, отряд Обол', 'S', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', 'Нет', '0', '0', 'Agent_Trigger.webp'),
        ('42', 'Укинами Юдзуха', 'Хижина кошмаров', 'S', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', 'Нет', '0', '0', 'Agent_Ukinami_Yuzuha.webp'),
        ('43', 'Йидхари Мёрфи', 'Хижина кошмаров', 'S', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', 'Нет', '0', '0', 'Agent_Yidhari_Murphy.webp'),
        ('44', 'Чжу Юань', 'Группа особого реагирования угрозыска', 'S', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', 'Нет', '0', '0', 'Agent_Zhu_Yuan.webp'),
        ('45', 'Баньюэ', 'Надзорная служба "Крампус"', 'S', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', 'Нет', '0', '0', 'Agent_Banyue.webp'),
        ('46', 'Чжао','Надзорная служба "Крампус"','S', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', 'Нет', '0', '0', 'Agent_Zhao_Portrait.webp'),
        ('47', 'Е Шуньгуан','Школа горы Юнькуй','S', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', 'Нет', '0', '0', 'Agent_Ye_Shunguang_Portrait.webp')
    ]

    added = 0
    updated = 0
    
    for (
        cid, cname, ctype, cclass,
        clevel, cmental, cskill1, cskill2,
        cskill3, cskill4, cskill5, cskillstrength,
        cdisk1, cdisk2, cdisk3, cdisk4,
        cdisk5, cdisk6, campunique, camplevel,
        camlstars, cimageurl
        ) in characters:
        character = db.session.get(Character_stats, cid)
        if character:
            character.character_name = cname
            character.character_type = ctype
            character.character_class = cclass
            character_image_url = cimageurl
            updated += 1
        else:
            db.session.add(Character_stats(
                character_id=cid,
                character_name=cname,
                character_type=ctype,
                character_class=cclass,
                character_level=clevel,
                character_mental_picture=cmental,
                character_skill_1=cskill1,
                character_skill_2=cskill2,
                character_skill_3=cskill3,
                character_skill_4=cskill4,
                character_skill_5=cskill5,
                character_skill_strength=cskillstrength,
                character_disk_1=cdisk1,
                character_disk_2=cdisk2,
                character_disk_3=cdisk3,
                character_disk_4=cdisk4,
                character_disk_5=cdisk5,
                character_disk_6=cdisk6,
                character_amplificator_unique=campunique,
                character_amplificator_level=camplevel,
                character_amplificator_stars=camlstars,
                character_image_url=cimageurl
            ))
            added += 1
    db.session.commit()
    print(f"[ 002 ][ {'Персонажи':<20} ][ {(added):>03d} записей добавлено ][ {(updated):>03d} записей просмотрено ]")
