from .tables import db, Bangboo_stats, Characters_stats

def seed_bangboo():
    if db.session.query(Bangboo_stats).first():
        return

    print("[ 000 ][ Прямо сейчас добавляются первичные данные в таблцы ]")
    bangboo = [
        ('1', 'Щелкун', '0', '0', 'S', 'Snap.webp'),
	('2', 'Красный Моккус', '0', '0', 'S', 'Red_Moccus.webp'),
	('3', 'Револьвербу', '0', '0', 'S', 'Bangvolver.webp'),
	('4', 'Резонабу', '0', '0', 'S', 'Resonaboo.webp'),
	('5', 'Амиллион', '0', '0', 'S', 'Amillion.webp'),
	('6', 'Госпожа Эсме', '0', '0', 'S', 'Miss_Esme.webp'),
	('7', 'Деталькабу', '0', '0', 'A', 'Bild_N.webp'),
	('8', 'Перерабу', '0', '0', 'A', 'Overtimeboo.webp'),
	('9', 'Борьбу', '0', '0', 'A', 'Brawlerboo.webp'),
	('10', 'Рыцарьбу', '0', '0', 'A', 'Knightboo.webp'),
	('11', 'Злобнобу', '0', '0', 'A', 'Baddieboo.webp'),
	('12', 'Магнитобу', '0', '0', 'A', 'Magnetiboo.webp'),
	('13', 'Вельзебу', '0', '0', 'A', 'Devilboo.webp'),
	('14', 'Баробу', '0', '0', 'A', 'Booressure.webp'),
	('15', 'Электробу', '0', '0', 'A', 'Electroboo.webp'),
	('16', 'Яблочкобу', '0', '0', 'A', 'Boollseye.webp'),
	('17', 'Авокабу', '0', '0', 'A', 'Avocaboo.webp'),
	('18', 'Плаксабу', '0', '0', 'A', 'Cryboo.webp'),
	('19', 'Пакетник', '0', '0', 'A', 'Bagboo.webp'),
	('20', 'Бумабу', '0', '0', 'A', 'Paperboo.webp'),
	('21', 'Сумобу', '0', '0', 'A', 'Sumoboo.webp'),
	('22', 'Искатель', '0', '0', 'A', 'Exploreboo.webp'),
	('23', 'Пингвибу', '0', '0', 'A', 'Penguinboo.webp'),
	('24', 'Бирклик', '0', '0', 'S', 'Birkblick.webp'),
	('25', 'Меркурий', '0', '0', 'S', 'Mercury.webp'),
	('26', 'Львец', '0', '0', 'S', 'Belion.webp'),
	('27', 'Робин', '0', '0', 'S', 'Robin.webp'),
	('28', 'Агент Гулливер', '0', '0', 'S', 'Agent_Gulliver.webp'),
	('29', 'Офицер Цуй', '0', '0', 'S', 'Officer_Cui.webp'),
	('30', 'Мажордом', '0', '0', 'S', 'Butler.webp'),
	('31', 'Акулабу', '0', '0', 'S', 'Sharkboo.webp'),
	('32', 'Штекербу', '0', '0', 'S', 'Plugboo.webp'),
	('33', 'Ракетабу', '0', '0', 'S', 'Rocketboo.webp'),
	('34', 'Прорабу', '0', '0', 'S', 'Safety.webp'),
	('35', 'Экскалибу', '0', '0', 'A', 'Excaliboo.webp'),
	('36', 'Счастливчик', '0', '0', 'A', 'Luckyboo.webp')
        ]
    for bid, bname, blevel, bstars, bclass, burl in bangboo:
        db.session.add(Bangboo_stats(bangboo_id=bid, bangboo_name=bname, bangboo_level=blevel, bangboo_stars=bstars, bangboo_class=bclass, bangboo_image_url=burl))
    db.session.commit()
    print("[ 001 ][ 36 банбу было добавлено при первом запуске ]")


def seed_characters():
    if db.session.query(Characters_stats).first():
        return

    characters = [
        ('1', 'Солдат 0 Энби', 'Вооружённые силы, Серебрянный отряд', 'S', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', 'Нет', '0', '0', 'Agent_Soldier_0_-_Anby.webp'),
        ('2', 'Джейн Доу', 'Группа особого реагирования угрозыска', 'S', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', 'Нет', '0', '0', 'Agent_Jane_Doe.webp'),
        ('3', 'Хосими Мияби', 'Секция 6', 'S', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', 'Нет', '0', '0', 'Agent_Hoshimi_Miyabi.webp'),
        ('4', 'Цукисиро Янаги', 'Секция 6', 'S', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', 'Нет', '0', '0', 'Agent_Tsukishiro_Yanagi.webp'),
        ('5', 'Бёрнис Вайт', 'Сыны Калидона', 'S', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', 'Нет', '0', '0', 'Agent_Burnice_White.webp'),
        ('6', 'Пайпер Вилл', 'Сыны Калидона', 'A', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', 'Нет', '0', '0', 'Agent_Piper_Wheel.webp'),
        ('7', 'Коляда Белобог', '"Белобог"', 'S', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', 'Нет', '0', '0', 'Agent_Koleda_Belobog.webp'),
        ('8', 'Александрина Себастьян', '"Виктория"', 'S', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', 'Нет', '0', '0', 'Agent_Alexandrina_Sebastian.webp'),
        ('9', 'Цзюй Фуфу', 'Школа горы Юнькуй', 'S', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', 'Нет', '0', '0', 'Agent_Ju_Fufu.webp'),
        ('10', 'Исюань', 'Школа горы Юнькуй', 'S', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', 'Нет', '0', '0', 'Agent_Yixuan.webp'),
        ('11', 'Пань Иньху', 'Школа горы Юнькуй', 'A', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', 'Нет', '0', '0', 'Agent_Pan_Yinhu.webp'),
        ('12', 'Хуго Влад', '"Пересмешники"', 'S', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', 'Нет', '0', '0', 'Agent_Hugo_Vlad.webp'),
        ('13', 'Вивиан Банши', '"Пересмешники"', 'S', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', 'Нет', '0', '0', 'Agent_Vivian_Banshee.webp'),
        ('14', 'Эвелин Шевалье', '"Созвездие Лиры"', 'S', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', 'Нет', '0', '0', 'Agent_Evelyn_Chevalier.webp'),
        ('15', 'Сет Лоуэлл', 'Группа особого реагирования угрозыска', 'A', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', 'Нет', '0', '0', 'Agent_Seth_Lowell.webp'),
        ('16', 'Асаба Харумаса', 'Секция 6', 'A', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', 'Нет', '0', '0', 'Agent_Asaba_Harumasa.webp'),
        ('17', 'Сокаку', 'Секция 6', 'A', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', 'Нет', '0', '0', 'Agent_Soukaku.webp'),
        ('18', 'Солдат 11', 'Вооружённые силы, отряд Обол', 'S', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', 'Нет', '0', '0', 'Agent_Soldier_11.webp'),
        ('19', 'Пульхра Феллини', 'Сыны Калидона', 'A', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', 'Нет', '0', '0', 'Agent_Pulchra_Fellini.webp'),
        ('20', 'Люсиана де Монтефио', 'Сыны Калидона', 'A', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', 'Нет', '0', '0', 'Agent_Luciana_de_Montefio.webp'),
        ('21', 'Грейс Ховард', '"Белобог"', 'S', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', 'Нет', '0', '0', 'Agent_Grace_Howard.webp'),
        ('22', 'Антон Иванов', '"Белобог"', 'A', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', 'Нет', '0', '0', 'Agent_Anton_Ivanov.webp'),
        ('23', 'Бен Биггер', '"Белобог"', 'A', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', 'Нет', '0', '0', 'Agent_Ben_Bigger.webp'),
        ('24', 'Фон Ликаон', '"Виктория"', 'S', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', 'Нет', '0', '0', 'Agent_Von_Lycaon.webp'),
        ('25', 'Корин Уикс', '"Виктория"', 'A', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', 'Нет', '0', '0', 'Agent_Corin_Wickes.webp'),
        ('26', 'Нэкомия Мана', '"Хитрые зайцы"', 'S', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', 'Нет', '0', '0', 'Agent_Nekomiya_Mana.webp'),
        ('27', 'Николь Демара', '"Хитрые зайцы"', 'A', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', 'Нет', '0', '0', 'Agent_Nicole_Demara.webp'),
        ('28', 'Билли Кид', '"Хитрые зайцы"', 'A', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', 'Нет', '0', '0', 'Agent_Billy_Kid.webp'),
        ('29', 'Энби Демара', '"Хитрые зайцы"', 'A', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', 'Нет', '0', '0', 'Agent_Anby_Demara.webp'),
        ('30', 'Диалинь', 'Надзорная служба "Крампус"', 'S', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', 'Нет', '0', '0', 'Agent_Dialyn.webp'),
        ('31', 'Элис Таймфилд', 'Хижина кошмаров', 'S', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', 'Нет', '0', '0', 'Agent_Alice_Thymefield.webp'),
        ('32', 'Астра Яо', '"Созвездие Лиры"', 'S', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', 'Нет', '0', '0', 'Agent_Astra_Yao.webp'),
        ('33', 'Цезарь Кинг', 'Сыны Калидона', 'S', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', 'Нет', '0', '0', 'Agent_Caesar_King.webp'),
        ('34', 'Эллен Джо', '"Виктория"', 'S', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', 'Нет', '0', '0', 'Agent_Ellen_Joe.webp'),
        ('35', 'Комано Манато', 'Хижина кошмаров', 'A', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', 'Нет', '0', '0', 'Agent_Komano_Manato.webp'),
        ('36', 'Лайтер', 'Сыны Калидона', 'S', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', 'Нет', '0', '0', 'Agent_Lighter.webp'),
        ('37', 'Люсия Элоувен', 'Хижина кошмаров', 'S', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', 'Нет', '0', '0', 'Agent_Lucia_Elowen.webp'),
        ('38', 'Орфея и Магус', 'Вооружённые силы, отряд Обол', 'S', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', 'Нет', '0', '0', 'Agent_Orphie_Magnusson_&_Magus.webp'),
        ('39', 'Циньи', 'Группа особого реагирования угрозыска', 'S', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', 'Нет', '0', '0', 'Agent_Qingyi.webp'),
        ('40', 'Сид', 'Вооружённые силы, отряд Обол', 'S', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', 'Нет', '0', '0', 'Agent_Seed.webp'),
        ('41', 'Гашетка', 'Вооружённые силы, отряд Обол', 'S', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', 'Нет', '0', '0', 'Agent_Trigger.webp'),
        ('42', 'Укинами Юдзуха', 'Хижина кошмаров', 'S', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', 'Нет', '0', '0', 'Agent_Ukinami_Yuzuha.webp'),
        ('43', 'Йидхари Мёрфи', 'Хижина кошмаров', 'S', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', 'Нет', '0', '0', 'Agent_Yidhari_Murphy.webp'),
        ('44', 'Чжу Юань', 'Группа особого реагирования угрозыска', 'S', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', 'Нет', '0', '0', 'Agent_Zhu_Yuan.webp'),
        ('45', 'Баньюэ', 'Надзорная служба "Крампус"', 'S', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', 'Нет', '0', '0', 'Agent_Banyue.webp')
                ]

    for (
        cid, cname, ctype, cclass,
        clevel, cmental, cskill1, cskill2,
        cskill3, cskill4, cskill5, cskillstrength,
        cdisk1, cdisk2, cdisk3, cdisk4,
        cdisk5, cdisk6, campunique, camplevel,
        camlstars, cimageurl
        ) in characters:
        db.session.add(Characters_stats(
            character_id=cid,
            character_name=cname,
            character_type=ctype,
            character_class=cclass,
            character_level=clevel,
            character_mental_picture=cmental,
            character_skill_1=cskill1,
            character_skill_2=cskill2,
            character_skill_3=cskill3,
            character_skill_4=cskill4,
            character_skill_5=cskill5,
            character_skill_strength=cskillstrength,
            character_disk_1=cdisk1,
            character_disk_2=cdisk2,
            character_disk_3=cdisk3,
            character_disk_4=cdisk4,
            character_disk_5=cdisk5,
            character_disk_6=cdisk6,
            character_amplificator_unique=campunique,
            character_amplificator_level=camplevel,
            character_amplificator_stars=camlstars,
            character_image_url=cimageurl))
    db.session.commit()
    print("[ 002 ][ 44 персонажа было добавлено при первом запуске ]")
